tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1614_tdd.h
#define P                             522
#define D_nA                          523
#define CKE                           524
#define SMP                           525
#define SSP1CON1                      526
#define SSPM0                         527
#define SSPM                          528
#define SSPM1                         529
#define SSPM2                         530
#define SSPM3                         531
#define CKP                           532
#define SSPEN                         533
#define SSPOV                         534
#define WCOL                          535
#define SSP1CON2                      536
#define SSP1CON2_SEN                  537
#define RSEN                          538
#define PEN                           539
#define RCEN                          540
#define ACKEN                         541
#define ACKDT                         542
#define ACKSTAT                       543
#define GCEN                          544
#define SSP1CON3                      545
#define DHEN                          546
#define AHEN                          547
#define SBCDE                         548
#define SDAHT                         549
#define BOEN                          550
#define SCIE                          551
#define PCIE                          552
#define ACKTIM                        553
#define ODCONA                        554
#define ODA0                          555
#define ODA1                          556
#define ODA2                          557
#define ODA4                          558
#define ODA5                          559
#define ODCONC                        560
#define ODC0                          561
#define ODC1                          562
#define ODC2                          563
#define ODC3                          564
#define ODC4                          565
#define ODC5                          566
#define CCPR1L                        567
#define CCPR1L_RL                     568
#define CCPR1H                        569
#define CCPR1H_RH                     570
#define CCP1CON                       571
#define CCP1MODE0                     572
#define CCP1CON_MODE0                 573
#define CCP1CON_MODE                  574
#define CCP1MODE                      575
#define CCP1MODE1                     576
#define CCP1CON_MODE1                 577
#define CCP1MODE2                     578
#define CCP1CON_MODE2                 579
#define CCP1MODE3                     580
#define CCP1CON_MODE3                 581
#define CCP1CON_FMT                   582
#define CCP1FMT                       583
#define CCP1CON_OUT                   584
#define CCP1OUT                       585
#define CCP1EN                        586
#define CCP1CON_EN                    587
#define CCP1CAP                       588
#define CCP1CTS0                      589
#define CCP1CAP_CTS                   590
#define CCP1CAP_CTS0                  591
#define CCP1CTS                       592
#define CCP1CTS1                      593
#define CCP1CAP_CTS1                  594
#define CCP1CTS2                      595
#define CCP1CAP_CTS2                  596
#define CCPR2L                        597
#define CCPR2L_RL                     598
#define CCPR2H                        599
#define CCPR2H_RH                     600
#define CCP2CON                       601
#define CCP2MODE                      602
#define CCP2MODE0                     603
#define CCP2CON_MODE0                 604
#define CCP2CON_MODE                  605
#define CCP2MODE1                     606
#define CCP2CON_MODE1                 607
#define CCP2MODE2                     608
#define CCP2CON_MODE2                 609
#define CCP2MODE3                     610
#define CCP2CON_MODE3                 611
#define CCP2FMT                       612
#define CCP2CON_FMT                   613
#define CCP2OUT                       614
#define CCP2CON_OUT                   615
#define CCP2EN                        616
#define CCP2CON_EN                    617
#define CCP2CAP                       618
#define CCP2CAP_CTS                   619
#define CCP2CAP_CTS0                  620
#define CCP2CTS                       621
#define CCP2CTS0                      622
#define CCP2CAP_CTS1                  623
#define CCP2CTS1                      624
#define CCP2CAP_CTS2                  625
#define CCP2CTS2                      626
#define CCPTMRS                       627
#define CCP1TSEL0                     628
#define CCP1TSEL                      629
#define CCP1TSEL1                     630
#define CCP2TSEL0                     631
#define CCP2TSEL                      632
#define CCP2TSEL1                     633
#define P3TSEL                        634
#define P3TSEL0                       635
#define P3TSEL1                       636
#define P4TSEL0                       637
#define P4TSEL                        638
#define P4TSEL1                       639
#define SLRCONA                       640
#define SLRA0                         641
#define SLRA1                         642
#define SLRA2                         643
#define SLRA4                         644
#define SLRA5                         645
#define SLRCONC                       646
#define SLRC0                         647
#define SLRC1                         648
#define SLRC2                         649
#define SLRC3                         650
#define SLRC4                         651
#define SLRC5                         652
#define INLVLA                        653
#define INLVLA0                       654
#define INLVLA1                       655
#define INLVLA2                       656
#define INLVLA3                       657
#define INLVLA4                       658
#define INLVLA5                       659
#define INLVLC                        660
#define INLVLC0                       661
#define INLVLC1                       662
#define INLVLC2                       663
#define INLVLC3                       664
#define INLVLC4                       665
#define INLVLC5                       666
#define IOCAP                         667
#define IOCAP0                        668
#define IOCAP1                        669
#define IOCAP2                        670
#define IOCAP3                        671
#define IOCAP4                        672
#define IOCAP5                        673
#define IOCAN0                        674
#define IOCAN                         675
#define IOCAN1                        676
#define IOCAN2                        677
#define IOCAN3                        678
#define IOCAN4                        679
#define IOCAN5                        680
#define IOCAF0                        681
#define IOCAF                         682
#define IOCAF1                        683
#define IOCAF2                        684
#define IOCAF3                        685
#define IOCAF4                        686
#define IOCAF5                        687
#define IOCCP                         688
#define IOCCP0                        689
#define IOCCP1                        690
#define IOCCP2                        691
#define IOCCP3                        692
#define IOCCP4                        693
#define IOCCP5                        694
#define IOCCN                         695
#define IOCCN0                        696
#define IOCCN1                        697
#define IOCCN2                        698
#define IOCCN3                        699
#define IOCCN4                        700
#define IOCCN5                        701
#define IOCCF                         702
#define IOCCF0                        703
#define IOCCF1                        704
#define IOCCF2                        705
#define IOCCF3                        706
#define IOCCF4                        707
#define IOCCF5                        708
#define HIDRVC                        709
#define HIDC4                         710
#define HIDC5                         711
#define T4TMR                         712
#define TMR4                          713
#define T4TMR_TMR                     714
#define T4PR_PR                       715
#define T4PR                          716
#define T4CON                         717
#define T4OUTPS0                      718
#define T4CON_OUTPS                   719
#define T4OUTPS                       720
#define T4CON_OUTPS0                  721
#define T4OUTPS1                      722
#define T4CON_OUTPS1                  723
#define T4CON_OUTPS2                  724
#define T4OUTPS2                      725
#define T4OUTPS3                      726
#define T4CON_OUTPS3                  727
#define T4CON_CKPS0                   728
#define T4CKPS0                       729
#define T4CON_CKPS                    730
#define T4CKPS                        731
#define T4CKPS1                       732
#define T4CON_CKPS1                   733
#define T4CKPS2                       734
#define T4CON_CKPS2                   735
#define T4ON                          736
#define T4CON_ON                      737
#define TMR4ON                        738
#define T4HLT                         739
#define T4MODE                        740
#define T4HLT_MODE                    741
#define T4HLT_MODE0                   742
#define T4MODE0                       743
#define T4HLT_MODE1                   744
#define T4MODE1                       745
#define T4HLT_MODE2                   746
#define T4MODE2                       747
#define T4HLT_MODE3                   748
#define T4MODE3                       749
#define T4HLT_MODE4                   750
#define T4MODE4                       751
#define T4CKSYNC                      752
#define T4HLT_CKSYNC                  753
#define T4HLT_CKPOL                   754
#define T4CKPOL                       755
#define T4PSYNC                       756
#define T4HLT_PSYNC                   757
#define T4CLKCON                      758
#define T4CS                          759
#define T4CLKCON_CS                   760
#define T4CS0                         761
#define T4CLKCON_CS0                  762
#define T4CS1                         763
#define T4CLKCON_CS1                  764
#define T4CS2                         765
#define T4CLKCON_CS2                  766
#define T4CS3                         767
#define T4CLKCON_CS3                  768
#define T4RST                         769
#define T4RSEL0                       770
#define T4RSEL                        771
#define T4RST_RSEL                    772
#define T4RST_RSEL0                   773
#define T4RSEL1                       774
#define T4RST_RSEL1                   775
#define T4RSEL2                       776
#define T4RST_RSEL2                   777
#define T4RSEL3                       778
#define T4RST_RSEL3                   779
#define T6TMR                         780
#define TMR6                          781
#define T6TMR_TMR                     782
#define T6PR_PR                       783
#define T6PR                          784
#define T6CON                         785
#define T6CON_OUTPS0                  786
#define T6OUTPS                       787
#define T6CON_OUTPS                   788
#define T6OUTPS0                      789
#define T6CON_OUTPS1                  790
#define T6OUTPS1                      791
#define T6CON_OUTPS2                  792
#define T6OUTPS2                      793
#define T6CON_OUTPS3                  794
#define T6OUTPS3                      795
#define T6CON_CKPS0                   796
#define T6CKPS                        797
#define T6CKPS0                       798
#define T6CON_CKPS                    799
#define T6CON_CKPS1                   800
#define T6CKPS1                       801
#define T6CON_CKPS2                   802
#define T6CKPS2                       803
#define TMR6ON                        804
#define T6ON                          805
#define T6CON_ON                      806
#define T6HLT                         807
#define T6MODE0                       808
#define T6HLT_MODE0                   809
#define T6HLT_MODE                    810
#define T6MODE                        811
#define T6HLT_MODE1                   812
#define T6MODE1                       813
#define T6HLT_MODE2                   814
#define T6MODE2                       815
#define T6HLT_MODE3                   816
#define T6MODE3                       817
#define T6MODE4                       818
#define T6HLT_MODE4                   819
#define T6CKSYNC                      820
#define T6HLT_CKSYNC                  821
#define T6CKPOL                       822
#define T6HLT_CKPOL                   823
#define T6PSYNC                       824
#define T6HLT_PSYNC                   825
#define T6CLKCON                      826
#define T6CS                          827
#define T6CLKCON_CS                   828
#define T6CLKCON_CS0                  829
#define T6CS0                         830
#define T6CLKCON_CS1                  831
#define T6CS1                         832
#define T6CLKCON_CS2                  833
#define T6CS2                         834
#define T6CLKCON_CS3                  835
#define T6CS3                         836
#define T6RST                         837
#define T6RST_RSEL                    838
#define T6RST_RSEL0                   839
#define T6RSEL                        840
#define T6RSEL0                       841
#define T6RST_RSEL1                   842
#define T6RSEL1                       843
#define T6RSEL2                       844
#define T6RST_RSEL2                   845
#define T6RST_RSEL3                   846
#define T6RSEL3                       847
#define TMR3L                         848
#define TMR3H                         849
#define T3CON                         850
#define TMR3ON                        851
#define T3SYNC                        852
#define T3CKPS                        853
#define T3CKPS0                       854
#define T3CKPS1                       855
#define TMR3CS0                       856
#define TMR3CS                        857
#define TMR3CS1                       858
#define T3GCON                        859
#define T3GSS0                        860
#define T3GSS                         861
#define T3GSS1                        862
#define T3GVAL                        863
#define T3GGO_nDONE                   864
#define T3GSPM                        865
#define T3GTM                         866
#define T3GPOL                        867
#define TMR3GE                        868
#define TMR5L                         869
#define TMR5H                         870
#define T5CON                         871
#define TMR5ON                        872
#define T5SYNC                        873
#define T5CKPS                        874
#define T5CKPS0                       875
#define T5CKPS1                       876
#define TMR5CS0                       877
#define TMR5CS                        878
#define TMR5CS1                       879
#define T5GCON                        880
#define T5GSS                         881
#define T5GSS0                        882
#define T5GSS1                        883
#define T5GVAL                        884
#define T5GGO_nDONE                   885
#define T5GSPM                        886
#define T5GTM                         887
#define T5GPOL                        888
#define TMR5GE                        889
#define PID1SETL                      890
#define PID1SET0                      891
#define SET0                          892
#define PID1SET1                      893
#define SET1                          894
#define SET2                          895
#define PID1SET2                      896
#define SET3                          897
#define PID1SET3                      898
#define SET4                          899
#define PID1SET4                      900
#define SET5                          901
#define PID1SET5                      902
#define SET6                          903
#define PID1SET6                      904
#define SET7                          905
#define PID1SET7                      906
#define PID1SETH                      907
#define SET8                          908
#define PID1SET8                      909
#define SET9                          910
#define PID1SET9                      911
#define SET10                         912
#define PID1SET10                     913
#define SET11                         914
#define PID1SET11                     915
#define SET12                         916
#define PID1SET12                     917
#define SET13                         918
#define PID1SET13                     919
#define SET14                         920
#define PID1SET14                     921
#define SET15                         922
#define PID1SET15                     923
#define PID1INL                       924
#define IN0                           925
#define PID1IN0                       926
#define IN1                           927
#define PID1IN1                       928
#define IN2                           929
#define PID1IN2                       930
#define IN3                           931
#define PID1IN3                       932
#define IN4                           933
#define PID1IN4                       934
#define IN5                           935
#define PID1IN5                       936
#define IN6                           937
#define PID1IN6                       938
#define IN7                           939
#define PID1IN7                       940
#define PID1INH                       941
#define IN8                           942
#define PID1IN8                       943
#define IN9                           944
#define PID1IN9                       945
#define PID1IN10                      946
#define IN10                          947
#define PID1IN11                      948
#define IN11                          949
#define PID1IN12                      950
#define IN12                          951
#define PID1IN13                      952
#define IN13                          953
#define PID1IN14                      954
#define IN14                          955
#define IN15                          956
#define PID1IN15                      957
#define PID1K1L                       958
#define K10                           959
#define PID1K10                       960
#define K11                           961
#define PID1K11                       962
#define K12                           963
#define PID1K12                       964
#define K13                           965
#define PID1K13                       966
#define K14                           967
#define PID1K14                       968
#define K15                           969
#define PID1K15                       970
#define K16                           971
#define PID1K16                       972
#define K17                           973
#define PID1K17                       974
#define PID1K1H                       975
#define K18                           976
#define PID1K18                       977
#define K19                           978
#define PID1K19                       979
#define PID1K110                      980
#define K110                          981
#define PID1K111                      982
#define K111                          983
#define PID1K112                      984
#define K112                          985
#define PID1K113                      986
#define K113                          987
#define PID1K114                      988
#define K114                          989
#define PID1K115                      990
#define K115                          991
#define PID1K2L                       992
#define K20                           993
#define PID1K20                       994
#define K21                           995
#define PID1K21                       996
#define K22                           997
#define PID1K22                       998
#define K23                           999
#define PID1K23                       1000
#define K24                           1001
#define PID1K24                       1002
#define K25                           1003
#define PID1K25                       1004
#define K26                           1005
#define PID1K26                       1006
#define K27                           1007
#define PID1K27                       1008
#define PID1K2H                       1009
#define K28                           1010
#define PID1K28                       1011
#define K29                           1012
#define PID1K29                       1013
#define PID1K210                      1014
#define K210                          1015
#define PID1K211                      1016
#define K211                          1017
#define PID1K212                      1018
#define K212                          1019
#define PID1K213                      1020
#define K213                          1021
#define PID1K214                      1022
#define K214                          1023
#define PID1K215                      1024
#define K215                          1025
#define PID1K3L                       1026
#define K30                           1027
#define PID1K30                       1028
#define K31                           1029
#define PID1K31                       1030
#define K32                           1031
#define PID1K32                       1032
#define K33                           1033
#define PID1K33                       1034
#define K34                           1035
#define PID1K34                       1036
#define K35                           1037
#define PID1K35                       1038
#define K36                           1039
#define PID1K36                       1040
#define K37                           1041
#define PID1K37                       1042
#define PID1K3H                       1043
#define K38                           1044
#define PID1K38                       1045
#define PID1K39                       1046
#define K39                           1047
#define K310                          1048
#define PID1K310                      1049
#define K311                          1050
#define PID1K311                      1051
#define K312                          1052
#define PID1K312                      1053
#define K313                          1054
#define PID1K313                      1055
#define K314                          1056
#define PID1K314                      1057
#define K315                          1058
#define PID1K315                      1059
#define PID1OUTLL                     1060
#define OUT0                          1061
#define PID1OUT0                      1062
#define OUT1                          1063
#define PID1OUT1                      1064
#define OUT2                          1065
#define PID1OUT2                      1066
#define OUT3                          1067
#define PID1OUT3                      1068
#define OUT4                          1069
#define PID1OUT4                      1070
#define OUT5                          1071
#define PID1OUT5                      1072
#define OUT6                          1073
#define PID1OUT6                      1074
#define OUT7                          1075
#define PID1OUT7                      1076
#define PID1OUTLH                     1077
#define OUT8                          1078
#define PID1OUT8                      1079
#define OUT9                          1080
#define PID1OUT9                      1081
#define PID1OUT10                     1082
#define OUT10                         1083
#define PID1OUT11                     1084
#define OUT11                         1085
#define OUT12                         1086
#define PID1OUT12                     1087
#define OUT13                         1088
#define PID1OUT13                     1089
#define PID1OUT14                     1090
