tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1614_tdd.h
#define OUT14                         1091
#define PID1OUT15                     1092
#define OUT15                         1093
#define PID1OUTHL                     1094
#define PID1OUT16                     1095
#define OUT16                         1096
#define PID1OUT17                     1097
#define OUT17                         1098
#define OUT18                         1099
#define PID1OUT18                     1100
#define OUT19                         1101
#define PID1OUT19                     1102
#define OUT20                         1103
#define PID1OUT20                     1104
#define OUT21                         1105
#define PID1OUT21                     1106
#define OUT22                         1107
#define PID1OUT22                     1108
#define OUT23                         1109
#define PID1OUT23                     1110
#define PID1OUTHH                     1111
#define OUT24                         1112
#define PID1OUT24                     1113
#define OUT25                         1114
#define PID1OUT25                     1115
#define OUT26                         1116
#define PID1OUT26                     1117
#define OUT27                         1118
#define PID1OUT27                     1119
#define OUT28                         1120
#define PID1OUT28                     1121
#define OUT29                         1122
#define PID1OUT29                     1123
#define PID1OUT30                     1124
#define OUT30                         1125
#define OUT31                         1126
#define PID1OUT31                     1127
#define PID1OUTU                      1128
#define OUT32                         1129
#define PID1OUT32                     1130
#define OUT33                         1131
#define PID1OUT33                     1132
#define OUT34                         1133
#define PID1OUT34                     1134
#define OUT35                         1135
#define PID1OUT35                     1136
#define PID1Z1L                       1137
#define PID1Z10                       1138
#define Z10                           1139
#define PID1Z11                       1140
#define Z11                           1141
#define PID1Z12                       1142
#define Z12                           1143
#define PID1Z13                       1144
#define Z13                           1145
#define PID1Z14                       1146
#define Z14                           1147
#define PID1Z15                       1148
#define Z15                           1149
#define PID1Z16                       1150
#define Z16                           1151
#define PID1Z17                       1152
#define Z17                           1153
#define PID1Z1H                       1154
#define Z18                           1155
#define PID1Z18                       1156
#define Z19                           1157
#define PID1Z19                       1158
#define Z110                          1159
#define PID1Z110                      1160
#define Z111                          1161
#define PID1Z111                      1162
#define Z112                          1163
#define PID1Z112                      1164
#define Z113                          1165
#define PID1Z113                      1166
#define Z114                          1167
#define PID1Z114                      1168
#define Z115                          1169
#define PID1Z115                      1170
#define PID1Z1U                       1171
#define Z116                          1172
#define PID1Z116                      1173
#define PID1Z2L                       1174
#define Z20                           1175
#define PID1Z20                       1176
#define Z21                           1177
#define PID1Z21                       1178
#define Z22                           1179
#define PID1Z22                       1180
#define Z23                           1181
#define PID1Z23                       1182
#define Z24                           1183
#define PID1Z24                       1184
#define Z25                           1185
#define PID1Z25                       1186
#define Z26                           1187
#define PID1Z26                       1188
#define Z27                           1189
#define PID1Z27                       1190
#define PID1Z2H                       1191
#define Z28                           1192
#define PID1Z28                       1193
#define Z29                           1194
#define PID1Z29                       1195
#define PID1Z210                      1196
#define Z210                          1197
#define PID1Z211                      1198
#define Z211                          1199
#define PID1Z212                      1200
#define Z212                          1201
#define PID1Z213                      1202
#define Z213                          1203
#define PID1Z214                      1204
#define Z214                          1205
#define PID1Z215                      1206
#define Z215                          1207
#define PID1Z2U                       1208
#define PID1Z216                      1209
#define Z216                          1210
#define PID1ACCLL                     1211
#define PID1ACCLL_ACC0                1212
#define PID1ACC0                      1213
#define PID1ACCLL_ACC1                1214
#define PID1ACC1                      1215
#define PID1ACCLL_ACC2                1216
#define PID1ACC2                      1217
#define PID1ACCLL_ACC3                1218
#define PID1ACC3                      1219
#define PID1ACCLL_ACC4                1220
#define PID1ACC4                      1221
#define PID1ACCLL_ACC5                1222
#define PID1ACC5                      1223
#define PID1ACCLL_ACC6                1224
#define PID1ACC6                      1225
#define PID1ACCLL_ACC7                1226
#define PID1ACC7                      1227
#define PID1ACCLH                     1228
#define PID1ACCLH_ACC8                1229
#define PID1ACC8                      1230
#define PID1ACCLH_ACC9                1231
#define PID1ACC9                      1232
#define PID1ACC10                     1233
#define PID1ACCLH_ACC10               1234
#define PID1ACC11                     1235
#define PID1ACCLH_ACC11               1236
#define PID1ACC12                     1237
#define PID1ACCLH_ACC12               1238
#define PID1ACC13                     1239
#define PID1ACCLH_ACC13               1240
#define PID1ACC14                     1241
#define PID1ACCLH_ACC14               1242
#define PID1ACC15                     1243
#define PID1ACCLH_ACC15               1244
#define PID1ACCHL                     1245
#define PID1ACC16                     1246
#define ACC16                         1247
#define PID1ACC17                     1248
#define ACC17                         1249
#define PID1ACC18                     1250
#define ACC18                         1251
#define PID1ACC19                     1252
#define ACC19                         1253
#define ACC20                         1254
#define PID1ACC20                     1255
#define ACC21                         1256
#define PID1ACC21                     1257
#define ACC22                         1258
#define PID1ACC22                     1259
#define ACC23                         1260
#define PID1ACC23                     1261
#define PID1ACCHH                     1262
#define ACC24                         1263
#define PID1ACC24                     1264
#define ACC25                         1265
#define PID1ACC25                     1266
#define ACC26                         1267
#define PID1ACC26                     1268
#define ACC27                         1269
#define PID1ACC27                     1270
#define ACC28                         1271
#define PID1ACC28                     1272
#define ACC29                         1273
#define PID1ACC29                     1274
#define PID1ACC30                     1275
#define ACC30                         1276
#define ACC31                         1277
#define PID1ACC31                     1278
#define PID1ACCU                      1279
#define ACC32                         1280
#define PID1ACC32                     1281
#define ACC33                         1282
#define PID1ACC33                     1283
#define PID1ACC34                     1284
#define ACC34                         1285
#define PID1CON                       1286
#define PID1CON_MODE0                 1287
#define PID1MODE0                     1288
#define PID1CON_MODE                  1289
#define PID1MODE                      1290
#define PID1CON_MODE1                 1291
#define PID1MODE1                     1292
#define PID1CON_MODE2                 1293
#define PID1MODE2                     1294
#define PID1CON_BUSY                  1295
#define PID1BUSY                      1296
#define PID1EN                        1297
#define PID1CON_EN                    1298
#define PWM3DCL                       1299
#define PWM3DC0                       1300
#define PWM3DCL_PWMPW0                1301
#define PWM3DCL_DC0                   1302
#define PWM3DCL_DC                    1303
#define PWM3DC1                       1304
#define PWM3DCL_PWMPW1                1305
#define PWM3DCL_DC1                   1306
#define PWM3DCH                       1307
#define PWM3DC2                       1308
#define PWM3DCH_DC2                   1309
#define PWM3DCH_DC                    1310
#define PWM3DCH_PWMPW2                1311
#define PWM3DC3                       1312
#define PWM3DCH_DC3                   1313
#define PWM3DCH_PWMPW3                1314
#define PWM3DC4                       1315
#define PWM3DCH_DC4                   1316
#define PWM3DCH_PWMPW4                1317
#define PWM3DC5                       1318
#define PWM3DCH_DC5                   1319
#define PWM3DCH_PWMPW5                1320
#define PWM3DC6                       1321
#define PWM3DCH_DC6                   1322
#define PWM3DCH_PWMPW6                1323
#define PWM3DC7                       1324
#define PWM3DCH_DC7                   1325
#define PWM3DCH_PWMPW7                1326
#define PWM3DC8                       1327
#define PWM3DCH_DC8                   1328
#define PWM3DCH_PWMPW8                1329
#define PWM3DC9                       1330
#define PWM3DCH_DC9                   1331
#define PWM3DCH_PWMPW9                1332
#define PWM3CON                       1333
#define PWM3CON_POL                   1334
#define PWM3POL                       1335
#define PWM3CON_OUT                   1336
#define PWM3OUT                       1337
#define PWM3EN                        1338
#define PWM3CON_EN                    1339
#define PWM4DCL                       1340
#define PWM4DCL_PWMPW0                1341
#define PWM4DCL_DC                    1342
#define PWM4DC0                       1343
#define PWM4DCL_DC0                   1344
#define PWM4DCL_PWMPW1                1345
#define PWM4DC1                       1346
#define PWM4DCL_DC1                   1347
#define PWM4DCH                       1348
#define PWM4DCH_PWMPW2                1349
#define PWM4DCH_DC                    1350
#define PWM4DC2                       1351
#define PWM4DCH_DC2                   1352
#define PWM4DCH_PWMPW3                1353
#define PWM4DC3                       1354
#define PWM4DCH_DC3                   1355
#define PWM4DCH_PWMPW4                1356
#define PWM4DC4                       1357
#define PWM4DCH_DC4                   1358
#define PWM4DCH_PWMPW5                1359
#define PWM4DC5                       1360
#define PWM4DCH_DC5                   1361
#define PWM4DCH_PWMPW6                1362
#define PWM4DC6                       1363
#define PWM4DCH_DC6                   1364
#define PWM4DCH_PWMPW7                1365
#define PWM4DC7                       1366
#define PWM4DCH_DC7                   1367
#define PWM4DCH_PWMPW8                1368
#define PWM4DC8                       1369
#define PWM4DCH_DC8                   1370
#define PWM4DCH_PWMPW9                1371
#define PWM4DC9                       1372
#define PWM4DCH_DC9                   1373
#define PWM4CON                       1374
#define PWM4POL                       1375
#define PWM4CON_POL                   1376
#define PWM4CON_OUT                   1377
#define PWM4OUT                       1378
#define PWM4EN                        1379
#define PWM4CON_EN                    1380
#define CWG1DBR0                      1381
#define CWG1DBR                       1382
#define DBR                           1383
#define DBR0                          1384
#define CWG1DBR1                      1385
#define DBR1                          1386
#define CWG1DBR2                      1387
#define DBR2                          1388
#define CWG1DBR3                      1389
#define DBR3                          1390
#define CWG1DBR4                      1391
#define DBR4                          1392
#define CWG1DBR5                      1393
#define DBR5                          1394
#define CWG1DBF                       1395
#define CWG1DBF0                      1396
#define DBF                           1397
#define DBF0                          1398
#define CWG1DBF1                      1399
#define DBF1                          1400
#define CWG1DBF2                      1401
#define DBF2                          1402
#define CWG1DBF3                      1403
#define DBF3                          1404
#define CWG1DBF4                      1405
#define DBF4                          1406
#define DBF5                          1407
#define CWG1DBF5                      1408
#define CWG1AS0                       1409
#define CWG1LSAC                      1410
#define LSAC                          1411
#define LSAC0                         1412
#define CWG1LSAC0                     1413
#define LSAC1                         1414
#define CWG1LSAC1                     1415
#define LSBD0                         1416
#define CWG1LSBD0                     1417
#define LSBD                          1418
#define CWG1LSBD                      1419
#define LSBD1                         1420
#define CWG1LSBD1                     1421
#define CWG1REN                       1422
#define REN                           1423
#define CWG1SHUTDOWN                  1424
#define SHUTDOWN                      1425
#define CWG1AS1                       1426
#define INAS                          1427
#define CWG1INAS                      1428
#define C1AS                          1429
#define CWG1C1AS                      1430
#define C2AS                          1431
#define CWG1C2AS                      1432
#define TMR2AS                        1433
#define CWG1TMR2AS                    1434
#define CWG1TMR4AS                    1435
#define TMR4AS                        1436
#define CWG1TMR6AS                    1437
#define TMR6AS                        1438
#define CWG1OCON0                     1439
#define CWG1STRA                      1440
#define STRA                          1441
#define STRB                          1442
#define CWG1STRB                      1443
#define CWG1STRC                      1444
#define STRC                          1445
#define CWG1STRD                      1446
#define STRD                          1447
#define OVRA                          1448
#define CWG1OVRA                      1449
#define CWG1OVRB                      1450
#define OVRB                          1451
#define OVRC                          1452
#define CWG1OVRC                      1453
#define OVRD                          1454
#define CWG1OVRD                      1455
#define CWG1CON0                      1456
#define CWG1MODE0                     1457
#define CWG1CON0_MODE0                1458
#define CWG1MODE                      1459
#define CWG1CON0_MODE                 1460
#define CWG1MODE1                     1461
#define CWG1CON0_MODE1                1462
#define CWG1MODE2                     1463
#define CWG1CON0_MODE2                1464
#define LD                            1465
#define CWG1LD                        1466
#define CWG1CON0_EN                   1467
#define CWG1EN                        1468
#define G1EN                          1469
#define CWG1CON1                      1470
#define CWG1POLA                      1471
#define POLA                          1472
#define CWG1POLB                      1473
#define POLB                          1474
#define CWG1POLC                      1475
#define POLC                          1476
#define CWG1POLD                      1477
#define POLD                          1478
#define IN                            1479
#define CWG1IN                        1480
#define CWG1CLKCON                    1481
#define CWG1CLKCON_CS                 1482
#define CWG1CS                        1483
#define CWG1ISM                       1484
#define CWG1IS                        1485
#define IS                            1486
#define IS0                           1487
#define CWG1IS0                       1488
#define CWG1IS1                       1489
#define IS1                           1490
#define IS2                           1491
#define CWG1IS2                       1492
#define IS3                           1493
#define CWG1IS3                       1494
#define WDTCON0                       1495
#define WDTCON0_SEN                   1496
#define SWDTEN                        1497
#define WDTSEN                        1498
#define WDTPS                         1499
#define WDTPS0                        1500
#define WDTPS1                        1501
#define WDTPS2                        1502
#define WDTPS3                        1503
#define WDTPS4                        1504
#define WDTCON1                       1505
#define WDTWINDOW0                    1506
#define WINDOW0                       1507
#define WINDOW                        1508
#define WDTWINDOW                     1509
#define WDTWINDOW1                    1510
#define WINDOW1                       1511
#define WDTWINDOW2                    1512
#define WINDOW2                       1513
#define WDTCS                         1514
#define WDTCS0                        1515
#define WDTCS1                        1516
#define WDTCS2                        1517
#define WDTPSL                        1518
#define WDTPSL_WDTPSCNT               1519
#define WDTPSL_PSCNT                  1520
#define WDTPSCNT0                     1521
#define PSCNT0                        1522
#define WDTPSCNT1                     1523
#define PSCNT1                        1524
#define WDTPSCNT2                     1525
#define PSCNT2                        1526
#define WDTPSCNT3                     1527
#define PSCNT3                        1528
#define WDTPSCNT4                     1529
#define PSCNT4                        1530
#define WDTPSCNT5                     1531
#define PSCNT5                        1532
#define WDTPSCNT6                     1533
#define PSCNT6                        1534
#define WDTPSCNT7                     1535
#define PSCNT7                        1536
#define WDTPSH                        1537
#define PSCNT8                        1538
#define WDTPSH_WDTPSCNT               1539
#define WDTPSH_PSCNT                  1540
#define WDTPSCNT8                     1541
#define PSCNT9                        1542
#define WDTPSCNT9                     1543
#define PSCNT10                       1544
#define WDTPSCNT10                    1545
#define PSCNT11                       1546
#define WDTPSCNT11                    1547
#define PSCNT12                       1548
#define WDTPSCNT12                    1549
#define PSCNT13                       1550
#define WDTPSCNT13                    1551
#define PSCNT14                       1552
#define WDTPSCNT14                    1553
#define PSCNT15                       1554
#define WDTPSCNT15                    1555
#define PSCNT16                       1556
#define WDTPSCNT16                    1557
#define WDTPSCNT17                    1558
#define PSCNT17                       1559
#define STATE                         1560
#define WDTSTATE                      1561
#define WDTTMR                        1562
#define WDTTMR0                       1563
#define WDTTMR1                       1564
#define WDTTMR2                       1565
#define WDTTMR3                       1566
#define WDTTMR4                       1567
#define SCANLADRL                     1568
#define SCANLADRL_LADR                1569
#define LDAR0                         1570
#define SCANLADRL_SCANLADR            1571
#define SCANLADR0                     1572
#define SCANLADR1                     1573
#define LDAR1                         1574
#define LADR2                         1575
#define SCANLADR2                     1576
#define LADR3                         1577
#define SCANLADR3                     1578
#define LADR4                         1579
#define SCANLADR4                     1580
#define LADR5                         1581
#define SCANLADR5                     1582
#define SCANLADR6                     1583
#define LADR6                         1584
#define LADR7                         1585
#define SCANLADR7                     1586
#define SCANLADRH                     1587
#define LADR8                         1588
#define SCANLADRH_SCANLADR            1589
#define SCANLADR8                     1590
#define SCANLADRH_LADR                1591
#define LADR9                         1592
#define SCANLADR9                     1593
#define LADR10                        1594
#define SCANLADR10                    1595
#define SCANLADR11                    1596
#define LADR11                        1597
#define LADR12                        1598
#define SCANLADR12                    1599
#define LADR13                        1600
#define SCANLADR13                    1601
#define LADR14                        1602
#define SCANLADR14                    1603
#define LADR15                        1604
#define SCANLADR15                    1605
#define SCANHADRL                     1606
#define SCANHADR0                     1607
#define HADR0                         1608
#define SCANHADRL_HADR                1609
#define SCANHADRL_SCANHADR            1610
#define SCANHADR1                     1611
#define HADR1                         1612
#define SCANHADR2                     1613
#define HARD2                         1614
#define SCANHADR3                     1615
#define HADR3                         1616
#define SCANHADR4                     1617
#define HADR4                         1618
#define SCANHADR5                     1619
#define HADR5                         1620
#define SCANHADR6                     1621
#define HADR6                         1622
#define SCANHADR7                     1623
#define HADR7                         1624
#define SCANHADRH                     1625
#define HADR8                         1626
#define SCANHADRH_SCANHADR            1627
#define SCANHADR8                     1628
#define SCANHADRH_HADR                1629
#define HADR9                         1630
#define SCANHADR9                     1631
#define HADR10                        1632
#define SCANHADR10                    1633
#define SCANHADR11                    1634
#define HADR11                        1635
#define HADR12                        1636
#define SCANHADR12                    1637
#define HADR13                        1638
#define SCANHADR13                    1639
#define HADR14                        1640
#define SCANHADR14                    1641
#define HADR15                        1642
#define SCANHADR15                    1643
#define SCANCON0                      1644
#define SCANMODE                      1645
#define SCANMODE0                     1646
#define SCANCON0_MODE0                1647
#define SCANCON0_MODE                 1648
