tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1614_tdd.h
#define SCANCON0_MODE1                1649
#define SCANMODE1                     1650
#define INTM                          1651
#define SCANINTM                      1652
#define INVALID                       1653
#define SCANINVALID                   1654
#define SCANCON0_BUSY                 1655
#define SCANBUSY                      1656
#define SCANGO                        1657
#define SCANEN                        1658
#define SCANCON0_EN                   1659
#define SCANTRIG                      1660
#define TSEL0                         1661
#define TSEL                          1662
#define SCANTSEL0                     1663
#define SCANTSEL                      1664
#define TSEL1                         1665
#define SCANTSEL1                     1666
#define TSEL2                         1667
#define SCANTSEL2                     1668
#define TSEL3                         1669
#define SCANTSEL3                     1670
#define CRCDATL                       1671
#define CRCDATL_DAT                   1672
#define CRCDAT0                       1673
#define DAT0                          1674
#define CRCDATL_CRCDAT                1675
#define CRCDAT1                       1676
#define DAT1                          1677
#define CRCDAT2                       1678
#define DAT2                          1679
#define CRCDAT3                       1680
#define DAT3                          1681
#define CRCDAT4                       1682
#define DAT4                          1683
#define CRCDAT5                       1684
#define DAT5                          1685
#define CRCDAT6                       1686
#define DAT6                          1687
#define DAT7                          1688
#define CRDCDAT7                      1689
#define CRCDATH                       1690
#define CRCDAT8                       1691
#define DAT8                          1692
#define CRCDATH_CRCDAT                1693
#define CRCDATH_DAT                   1694
#define CRCDAT9                       1695
#define DAT9                          1696
#define DAT10                         1697
#define CRCDAT10                      1698
#define DAT11                         1699
#define CRCDAT11                      1700
#define DAT12                         1701
#define CRCDAT12                      1702
#define DAT13                         1703
#define CRCDAT13                      1704
#define DAT14                         1705
#define CRCDAT14                      1706
#define DAT15                         1707
#define CRCDAT15                      1708
#define CRCACCL                       1709
#define CRCACCL_CRCACC                1710
#define CRCACC0                       1711
#define CRCACCL_ACC0                  1712
#define CRCACCL_ACC                   1713
#define CRCACC1                       1714
#define CRCACCL_ACC1                  1715
#define CRCACC2                       1716
#define CRCACCL_ACC2                  1717
#define CRCACC3                       1718
#define CRCACCL_ACC3                  1719
#define CRCACC4                       1720
#define CRCACCL_ACC4                  1721
#define CRCACC5                       1722
#define CRCACCL_ACC5                  1723
#define CRCACC6                       1724
#define CRCACCL_ACC6                  1725
#define CRCACC7                       1726
#define CRCACCL_ACC7                  1727
#define CRCACCH                       1728
#define CRCACCH_ACC                   1729
#define CRCACCH_CRCACC                1730
#define CRCACC8                       1731
#define CRCACCH_ACC8                  1732
#define CRCACC9                       1733
#define CRCACCH_ACC9                  1734
#define CRCACCH_ACC10                 1735
#define CRCACC10                      1736
#define CRCACCH_ACC11                 1737
#define CRCACC11                      1738
#define CRCACCH_ACC12                 1739
#define CRCACC12                      1740
#define CRCACCH_ACC13                 1741
#define CRCACC13                      1742
#define CRCACCH_ACC14                 1743
#define CRCACC14                      1744
#define CRCACCH_ACC15                 1745
#define CRCACC15                      1746
#define CRCSHIFTL                     1747
#define CRCSHIFTL_CRCSHIFT            1748
#define CRCSHIFTL_SHIFT               1749
#define SHIFT0                        1750
#define CRCSHIFT0                     1751
#define SHIFT1                        1752
#define CRCSHIFT1                     1753
#define SHIFT2                        1754
#define CRCSHIFT2                     1755
#define SHIFT3                        1756
#define CRCSHIFT3                     1757
#define SHIFT4                        1758
#define CRCSHIFT4                     1759
#define SHIFT5                        1760
#define CRCSHIFT5                     1761
#define SHIFT6                        1762
#define CRCSHIFT6                     1763
#define SHIFT7                        1764
#define CRCSHIFT7                     1765
#define CRCSHIFTH                     1766
#define CRCSHIFT8                     1767
#define CRCSHIFTH_SHIFT               1768
#define CRCSHIFTH_CRCSHIFT            1769
#define SHIFT8                        1770
#define CRCSHIFT9                     1771
#define SHIFT9                        1772
#define SHIFT10                       1773
#define CRCSHIFT10                    1774
#define SHIFT11                       1775
#define CRCSHIFT11                    1776
#define SHIFT12                       1777
#define CRCSHIFT12                    1778
#define SHIFT13                       1779
#define CRCSHIFT13                    1780
#define CRCSHIFT14                    1781
#define SHIFT14                       1782
#define SHIFT15                       1783
#define CRCSHIFT15                    1784
#define CRCXORL                       1785
#define XOR1                          1786
#define CRCXOR1                       1787
#define XOR2                          1788
#define CRCXOR2                       1789
#define XOR3                          1790
#define CRCXOR3                       1791
#define XOR4                          1792
#define CRCXOR4                       1793
#define XOR5                          1794
#define CRCXOR5                       1795
#define XOR6                          1796
#define CRCXOR6                       1797
#define XOR7                          1798
#define CRCXOR7                       1799
#define CRCXORH                       1800
#define XOR8                          1801
#define CRCXOR8                       1802
#define XOR9                          1803
#define CRCXOR9                       1804
#define CRCXOR10                      1805
#define XOR10                         1806
#define CRCXOR11                      1807
#define XOR11                         1808
#define XOR12                         1809
#define CRCXOR12                      1810
#define XOR13                         1811
#define CRCXOR13                      1812
#define CRCXOR14                      1813
#define XOR14                         1814
#define CRCXOR15                      1815
#define XOR15                         1816
#define CRCCON0                       1817
#define CRCFULL                       1818
#define FULL                          1819
#define CRCSHIFTM                     1820
#define SHIFTM                        1821
#define ACCM                          1822
#define CRCACCM                       1823
#define CRCCON0_BUSY                  1824
#define CRCBUSY                       1825
#define CRCGO                         1826
#define CRCCON0_EN                    1827
#define CRCEN                         1828
#define CRCCON1                       1829
#define PLEN0                         1830
#define CRCPLEN0                      1831
#define PLEN                          1832
#define CRCPLEN                       1833
#define PLEN1                         1834
#define CRCPLEN1                      1835
#define PLEN2                         1836
#define CRCPLEN2                      1837
#define PLEN3                         1838
#define CRCPLEN3                      1839
#define DLEN                          1840
#define CRCDLEN                       1841
#define CRCDLEN0                      1842
#define DLEN0                         1843
#define DLEN1                         1844
#define CRCDLEN1                      1845
#define CRCDLEN2                      1846
#define DLEN2                         1847
#define DLEN3                         1848
#define CRCDLEN3                      1849
#define AT1RESL                       1850
#define AT1RES0                       1851
#define RES0                          1852
#define RES1                          1853
#define AT1RES1                       1854
#define AT1RES2                       1855
#define RES2                          1856
#define AT1RES3                       1857
#define RES3                          1858
#define AT1RES4                       1859
#define RES4                          1860
#define AT1RES5                       1861
#define RES5                          1862
#define RES6                          1863
#define AT1RES6                       1864
#define AT1RES7                       1865
#define RES7                          1866
#define AT1RESH                       1867
#define RES8                          1868
#define AT1RES8                       1869
#define RES9                          1870
#define AT1RES9                       1871
#define AT1MISSL                      1872
#define AT1MISS0                      1873
#define MISS0                         1874
#define AT1MISS1                      1875
#define MISS1                         1876
#define AT1MISS2                      1877
#define MISS2                         1878
#define AT1MISS3                      1879
#define MISS3                         1880
#define AT1MISS4                      1881
#define MISS4                         1882
#define AT1MISS5                      1883
#define MISS5                         1884
#define AT1MISS6                      1885
#define MISS6                         1886
#define AT1MISS7                      1887
#define MISS7                         1888
#define AT1MISSH                      1889
#define MISS8                         1890
#define AT1MISS8                      1891
#define MISS9                         1892
#define AT1MISS9                      1893
#define MISS10                        1894
#define AT1MISS10                     1895
#define MISS11                        1896
#define AT1MISS11                     1897
#define AT1MISS12                     1898
#define MISS12                        1899
#define AT1MISS13                     1900
#define MISS13                        1901
#define AT1MISS14                     1902
#define MISS14                        1903
#define AT1MISS15                     1904
#define MISS15                        1905
#define AT1PERL                       1906
#define PER0                          1907
#define AT1PER0                       1908
#define PERL0                         1909
#define PER1                          1910
#define AT1PER1                       1911
#define PERL1                         1912
#define PER2                          1913
#define AT1PER2                       1914
#define PERL2                         1915
#define PER3                          1916
#define AT1PER3                       1917
#define PERL3                         1918
#define PER4                          1919
#define AT1PER4                       1920
#define PERL4                         1921
#define PER5                          1922
#define AT1PER5                       1923
#define PERL5                         1924
#define PER6                          1925
#define AT1PER6                       1926
#define PERL6                         1927
#define PER7                          1928
#define AT1PER7                       1929
#define PERL7                         1930
#define AT1PERH                       1931
#define PER8                          1932
#define AT1PER8                       1933
#define PERH0                         1934
#define PER9                          1935
#define AT1PER9                       1936
#define PERH1                         1937
#define AT1PER10                      1938
#define PER10                         1939
#define PERH2                         1940
#define AT1PER11                      1941
#define PER11                         1942
#define PERH3                         1943
#define AT1PER12                      1944
#define PER12                         1945
#define PERH4                         1946
#define AT1PER13                      1947
#define PER13                         1948
#define PERH5                         1949
#define AT1PER14                      1950
#define PER14                         1951
#define PERH6                         1952
#define PER15                         1953
#define AT1POV                        1954
#define PERH7                         1955
#define AT1PHSL                       1956
#define PHS0                          1957
#define AT1PHS0                       1958
#define PHS1                          1959
#define AT1PHS1                       1960
#define PHS2                          1961
#define AT1PHS2                       1962
#define PHS3                          1963
#define AT1PHS3                       1964
#define PHS4                          1965
#define AT1PHS4                       1966
#define PHS5                          1967
#define AT1PHS5                       1968
#define PHS6                          1969
#define AT1PHS6                       1970
#define PHS7                          1971
#define AT1PHS7                       1972
#define AT1PHSH                       1973
#define PHSL8                         1974
#define PHS8                          1975
#define AT1PHS8                       1976
#define PHSL9                         1977
#define PHS9                          1978
#define AT1PHS9                       1979
#define AT1CON0                       1980
#define AT1CON0_MODE                  1981
#define AT1MODE                       1982
#define APMOD                         1983
#define AT1APMOD                      1984
#define AT1CON0_POL                   1985
#define AT1POL                        1986
#define AT1PS0                        1987
#define AT1CON0_PS                    1988
#define AT1PS                         1989
#define AT1CON0_PS0                   1990
#define AT1PS1                        1991
#define AT1CON0_PS1                   1992
#define PREC                          1993
#define AT1PREC                       1994
#define AT1CON0_EN                    1995
#define AT1EN                         1996
#define AT1CON1                       1997
#define AT1VALID                      1998
#define VALID                         1999
#define AT1ACCS                       2000
#define ACCS                          2001
#define MPP                           2002
#define AT1MPP                        2003
#define AT1PRP                        2004
#define PRP                           2005
#define AT1PHP                        2006
#define PHP                           2007
#define AT1IR0                        2008
#define AT1PERIF                      2009
#define AT1MISSIF                     2010
#define AT1PHSIF                      2011
#define AT1IE0                        2012
#define AT1PERIE                      2013
#define AT1MISSIE                     2014
#define AT1PHSIE                      2015
#define AT1IR1                        2016
#define AT1CC1IF                      2017
#define AT1CC2IF                      2018
#define AT1CC3IF                      2019
#define AT1IE1                        2020
#define AT1CC1IE                      2021
#define AT1CC2IE                      2022
#define AT1CC3IE                      2023
#define AT1STPTL                      2024
#define STPT0                         2025
#define AT1STPT0                      2026
#define STPT1                         2027
#define AT1STPT1                      2028
#define STPT2                         2029
#define AT1STPT2                      2030
#define STPT3                         2031
#define AT1STPT3                      2032
#define STPT4                         2033
#define AT1STPT4                      2034
#define STPT5                         2035
#define AT1STPT5                      2036
#define STPT6                         2037
#define AT1STPT6                      2038
#define STPT7                         2039
#define AT1STPT7                      2040
#define AT1STPTH                      2041
#define STPT8                         2042
#define AT1STPT8                      2043
#define STPT9                         2044
#define AT1STPT9                      2045
#define AT1STPT10                     2046
#define STPT10                        2047
#define AT1STPT11                     2048
#define STPT11                        2049
#define AT1STPT12                     2050
#define STPT12                        2051
#define AT1STPT13                     2052
#define STPT13                        2053
#define AT1STPT14                     2054
#define STPT14                        2055
#define AT1ERRL                       2056
#define AT1ERR0                       2057
#define ERR0                          2058
#define ERRL0                         2059
#define AT1ERR1                       2060
#define ERR1                          2061
#define ERRL1                         2062
#define AT1ERR2                       2063
#define ERR2                          2064
#define ERRL2                         2065
#define AT1ERR3                       2066
#define ERR3                          2067
#define ERRL3                         2068
#define AT1ERR4                       2069
#define ERRL4                         2070
#define ERR4                          2071
#define AT1ERR5                       2072
#define ERRL5                         2073
#define ERR5                          2074
#define AT1ERR6                       2075
#define ERRL6                         2076
#define ERR6                          2077
#define AT1ERR7                       2078
#define ERRL7                         2079
#define ERR7                          2080
#define AT1ERRH                       2081
#define AT1ERR8                       2082
#define ERRH0                         2083
#define ERR8                          2084
#define AT1ERR9                       2085
#define ERRH1                         2086
#define ERR9                          2087
#define AT1ERR10                      2088
#define ERR10                         2089
#define ERRH2                         2090
#define AT1ERR11                      2091
#define ERR11                         2092
#define ERRH3                         2093
#define AT1ERR12                      2094
#define ERR12                         2095
#define ERRH4                         2096
#define AT1ERR13                      2097
#define ERR13                         2098
#define ERRH5                         2099
#define AT1ERR14                      2100
#define ERR14                         2101
#define ERRH6                         2102
#define AT1ERR15                      2103
#define ERR15                         2104
#define ERRH7                         2105
#define AT1CLK                        2106
#define AT1CLK_CS                     2107
#define AT1CS                         2108
#define AT1CLK_CS0                    2109
#define AT1CS0                        2110
#define AT1SIG                        2111
#define AT1SSEL0                      2112
#define AT1SIG_SSEL0                  2113
#define AT1SIG_SSEL                   2114
#define AT1SSEL                       2115
#define AT1SSEL1                      2116
#define AT1SIG_SSEL1                  2117
#define AT1SSEL2                      2118
#define AT1SIG_SSEL2                  2119
#define AT1CSEL1                      2120
#define CP1S0                         2121
#define AT1CP1S0                      2122
#define AT1CP1S                       2123
#define CP1S                          2124
#define CP1S1                         2125
#define AT1CP1S1                      2126
#define CP1S2                         2127
#define AT1CP1S2                      2128
#define AT1CC1L                       2129
#define AT1CC10                       2130
#define CC10                          2131
#define AT1CC11                       2132
#define CC11                          2133
#define AT1CC12                       2134
#define CC12                          2135
#define AT1CC1L_CC13                  2136
#define AT1CC13                       2137
#define AT1CC14                       2138
#define CC14                          2139
#define AT1CC15                       2140
#define CC15                          2141
#define AT1CC16                       2142
#define CC16                          2143
#define AT1CC17                       2144
#define CC17                          2145
#define AT1CC1H                       2146
#define CC18                          2147
#define AT1CC18                       2148
#define CC19                          2149
#define AT1CC19                       2150
#define AT1CCON1                      2151
#define AT1CC1MODE                    2152
#define CC1MODE                       2153
#define CAP1P                         2154
#define AT1CAP1P                      2155
#define CC1POL                        2156
#define AT1CC1POL                     2157
#define AT1CC1EN                      2158
#define CC1EN                         2159
#define AT1CSEL2                      2160
#define AT1CP2S0                      2161
#define AT1CP2S                       2162
#define CP2S0                         2163
#define CP2S                          2164
#define CP2S1                         2165
#define AT1CP2S1                      2166
#define AT1CP2S2                      2167
#define CP2S2                         2168
#define AT1CC2L                       2169
#define AT1CC20                       2170
#define CC20                          2171
#define AT1CC21                       2172
#define CC21                          2173
#define AT1CC22                       2174
#define CC22                          2175
#define AT1CC23                       2176
#define AT1CC2L_CC13                  2177
#define AT1CC24                       2178
#define CC24                          2179
#define AT1CC25                       2180
#define CCW5                          2181
#define AT1CC26                       2182
#define CC26                          2183
#define AT1CC27                       2184
#define CC27                          2185
#define AT1CC2H                       2186
#define CC28                          2187
#define AT1CC28                       2188
#define CC29                          2189
#define AT1CC29                       2190
#define AT1CCON2                      2191
#define CC2MODE                       2192
#define AT1CC2MODE                    2193
#define AT1CAP2P                      2194
#define CAP2P                         2195
#define AT1CC2POL                     2196
#define CC2POL                        2197
#define CC2EN                         2198
#define AT1CC2EN                      2199
#define AT1CSEL3                      2200
#define CP3S0                         2201
#define AT1CP3S                       2202
#define AT1CP3S0                      2203
#define CP3S                          2204
#define CP3S1                         2205
#define AT1CP3S1                      2206
