tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1614_tdd.h
#define CP3S2                         2207
#define AT1CP3S2                      2208
#define AT1CC3L                       2209
#define AT1CC30                       2210
#define CC30                          2211
#define AT1CC31                       2212
#define CC31                          2213
#define AT1CC32                       2214
#define CC32                          2215
#define AT1CC33                       2216
#define CC33                          2217
#define AT1CC34                       2218
#define CC34                          2219
#define AT1CC35                       2220
#define CC35                          2221
#define AT1CC36                       2222
#define CC36                          2223
#define AT1CC37                       2224
#define CC37                          2225
#define AT1CC3H                       2226
#define CC38                          2227
#define AT1CC38                       2228
#define CC39                          2229
#define AT1CC39                       2230
#define AT1CCON3                      2231
#define AT1CC3MODE                    2232
#define CC3MODE                       2233
#define AT1CAP3P                      2234
#define CAP3P                         2235
#define AT1CC3POL                     2236
#define CC3POL                        2237
#define CC3EN                         2238
#define AT1CC3EN                      2239
#define SMT1TMRL                      2240
#define SMT1TMR0                      2241
#define SMT1TMRL_SMT1TMR              2242
#define SMT1TMR1                      2243
#define SMT1TMR2                      2244
#define SMT1TMR3                      2245
#define SMT1TMR4                      2246
#define SMT1TMR5                      2247
#define SMT1TMR6                      2248
#define SMT1TMR7                      2249
#define SMT1TMRH                      2250
#define SMT1TMR8                      2251
#define SMT1TMRH_SMT1TMR              2252
#define SMT1TMR9                      2253
#define SMT1TMR10                     2254
#define SMT1TMR11                     2255
#define SMT1TMR12                     2256
#define SMT1TMR13                     2257
#define SMT1TMR14                     2258
#define SMT1TMR15                     2259
#define SMT1TMRU                      2260
#define SMT1TMR16                     2261
#define SMT1TMRU_SMT1TMR              2262
#define SMT1TMR17                     2263
#define SMT1TMR18                     2264
#define SMT1TMR19                     2265
#define SMT1TMR20                     2266
#define SMT1TMR21                     2267
#define SMT1TMR22                     2268
#define SMT1TMR23                     2269
#define SMT1CPRL                      2270
#define SMT1CPRL_SMT1CPR              2271
#define SMT1CPR0                      2272
#define SMT1CPR1                      2273
#define SMT1CPR2                      2274
#define SMT1CPR3                      2275
#define SMT1CPR4                      2276
#define SMT1CPR5                      2277
#define SMT1CPR6                      2278
#define SMT1CPR7                      2279
#define SMT1CPRH                      2280
#define SMT1CPRH_SMT1CPR              2281
#define SMT1CPR8                      2282
#define SMT1CPR9                      2283
#define SMT1CPR10                     2284
#define SMT1CPR11                     2285
#define SMT1CPR12                     2286
#define SMT1CPR13                     2287
#define SMT1CPR14                     2288
#define SMT1CPR15                     2289
#define SMT1CPRU                      2290
#define SMT1CPR16                     2291
#define SMT1CPRU_SMT1CPR              2292
#define SMT1CPR17                     2293
#define SMT1CPR18                     2294
#define SMT1CPR19                     2295
#define SMT1CPR20                     2296
#define SMT1CPR21                     2297
#define SMT1CPR22                     2298
#define SMT1CPR23                     2299
#define SMT1CPWL                      2300
#define SMT1CPW0                      2301
#define SMT1CPWL_SMT1CPW              2302
#define SMT1CPW1                      2303
#define SMT1CPW2                      2304
#define SMT1CPW3                      2305
#define SMT1CPW4                      2306
#define SMT1CPW5                      2307
#define SMT1CPW6                      2308
#define SMT1CPW7                      2309
#define SMT1CPWH                      2310
#define SMT1CPW8                      2311
#define SMT1CPWH_SMT1CPW              2312
#define SMT1CPW9                      2313
#define SMT1CPW10                     2314
#define SMT1CPW11                     2315
#define SMT1CPW12                     2316
#define SMT1CPW13                     2317
#define SMT1CPW14                     2318
#define SMT1CPW15                     2319
#define SMT1CPWU                      2320
#define SMT1CPWU_SMT1CPW              2321
#define SMT1CPW16                     2322
#define SMT1CPW17                     2323
#define SMT1CPW18                     2324
#define SMT1CPW19                     2325
#define SMT1CPW20                     2326
#define SMT1CPW21                     2327
#define SMT1CPW22                     2328
#define SMT1CPW23                     2329
#define SMT1PRL                       2330
#define SMT1PR0                       2331
#define SMT1PRL_SMT1PR                2332
#define SMT1PR1                       2333
#define SMT1PR2                       2334
#define SMT1PR3                       2335
#define SMT1PR4                       2336
#define SMT1PR5                       2337
#define SMT1PR6                       2338
#define SMT1PR7                       2339
#define SMT1PRH                       2340
#define SMT1PR8                       2341
#define SMT1PRH_SMT1PR                2342
#define SMT1PR9                       2343
#define SMT1PR10                      2344
#define SMT1PR11                      2345
#define SMT1PR12                      2346
#define SMT1PR13                      2347
#define SMT1PR14                      2348
#define SMT1PR15                      2349
#define SMT1PRU                       2350
#define SMT1PR16                      2351
#define SMT1PRU_SMT1PR                2352
#define SMT1PR17                      2353
#define SMT1PR18                      2354
#define SMT1PR19                      2355
#define SMT1PR20                      2356
#define SMT1PR21                      2357
#define SMT1PR22                      2358
#define SMT1PR23                      2359
#define SMT1CON0                      2360
#define SMT1PS0                       2361
#define SMT1PS                        2362
#define SMT1PS1                       2363
#define SMT1CON0_CPOL                 2364
#define SMT1CON0_SPOL                 2365
#define SMT1CON0_WPOL                 2366
#define SMT1CON0_STP                  2367
#define SMT1CON0_EN                   2368
#define SMT1CON1                      2369
#define SMT1MODE0                     2370
#define SMT1CON1_MODE                 2371
#define SMT1CON1_MODE0                2372
#define SMT1MODE                      2373
#define SMT1CON1_MODE1                2374
#define SMT1MODE1                     2375
#define SMT1CON1_MODE2                2376
#define SMT1MODE2                     2377
#define SMT1CON1_MODE3                2378
#define SMT1MODE3                     2379
#define SMT1CON1_REPEAT               2380
#define SMT1REPEAT                    2381
#define SMT1GO                        2382
#define SMT1STAT                      2383
#define SMT1STAT_AS                   2384
#define SMT1AS                        2385
#define SMT1STAT_WS                   2386
#define SMT1WS                        2387
#define SMT1STAT_TS                   2388
#define SMT1TS                        2389
#define SMT1RESET                     2390
#define SMT1STAT_RST                  2391
#define SMT1CPWUP                     2392
#define SMT1STAT_CPWUP                2393
#define SMT1CPRUP                     2394
#define SMT1STAT_CPRUP                2395
#define SMT1CLK                       2396
#define SMT1CLK_CSEL0                 2397
#define SMT1CSEL0                     2398
#define SMT1CSEL                      2399
#define SMT1CLK_CSEL                  2400
#define SMT1CSEL1                     2401
#define SMT1CLK_CSEL1                 2402
#define SMT1CSEL2                     2403
#define SMT1CLK_CSEL2                 2404
#define SMT1SIG                       2405
#define SMT1SSEL                      2406
#define SMT1SIG_SSEL0                 2407
#define SMT1SIG_SSEL                  2408
#define SMT1SSEL0                     2409
#define SMT1SIG_SSEL1                 2410
#define SMT1SSEL1                     2411
#define SMT1SIG_SSEL2                 2412
#define SMT1SSEL2                     2413
#define SMT1SIG_SSEL3                 2414
#define SMT1SSEL3                     2415
#define SMT1SIG_SSEL4                 2416
#define SMT1SSEL4                     2417
#define SMT1WIN                       2418
#define SMT1WSEL                      2419
#define SMT1WSEL0                     2420
#define SMT1WIN_WSEL0                 2421
#define SMT1WIN_WSEL                  2422
#define SMT1WSEL1                     2423
#define SMT1WIN_WSEL1                 2424
#define SMT1WIN_WSEL2                 2425
#define SMT1WSEL2                     2426
#define SMT1WIN_WSEL3                 2427
#define SMT1WSEL3                     2428
#define SMT1WIN_WSEL4                 2429
#define SMT1WSEL4                     2430
#define SMT2TMRL                      2431
#define SMT2TMRL_SMT2TMR              2432
#define SMT2TMR0                      2433
#define SMT2TMR1                      2434
#define SMT2TMR2                      2435
#define SMT2TMR3                      2436
#define SMT2TMR4                      2437
#define SMT2TMR5                      2438
#define SMT2TMR6                      2439
#define SMT2TMR7                      2440
#define SMT2TMRH                      2441
#define SMT2TMR8                      2442
#define SMT2TMRH_SMT2TMR              2443
#define SMT2TMR9                      2444
#define SMT2TMR10                     2445
#define SMT2TMR11                     2446
#define SMT2TMR12                     2447
#define SMT2TMR13                     2448
#define SMT2TMR14                     2449
#define SMT2TMR15                     2450
#define SMT2TMRU                      2451
#define SMT2TMR16                     2452
#define SMT2TMRU_SMT2TMR              2453
#define SMT2TMR17                     2454
#define SMT2TMR18                     2455
#define SMT2TMR19                     2456
#define SMT2TMR20                     2457
#define SMT2TMR21                     2458
#define SMT2TMR22                     2459
#define SMT2TMR23                     2460
#define SMT2CPRL                      2461
#define SMT2CPRL_SMT2CPR              2462
#define SMT2CPR0                      2463
#define SMT2CPR1                      2464
#define SMT2CPR2                      2465
#define SMT2CPR3                      2466
#define SMT2CPR4                      2467
#define SMT2CPR5                      2468
#define SMT2CPR6                      2469
#define SMT2CPR7                      2470
#define SMT2CPRH                      2471
#define SMT2CPR8                      2472
#define SMT2CPRH_SMT2CPR              2473
#define SMT2CPR9                      2474
#define SMT2CPR10                     2475
#define SMT2CPR11                     2476
#define SMT2CPR12                     2477
#define SMT2CPR13                     2478
#define SMT2CPR14                     2479
#define SMT2CPR15                     2480
#define SMT2CPRU                      2481
#define SMT2CPRU_SMT2CPR              2482
#define SMT2CPR16                     2483
#define SMT2CPR17                     2484
#define SMT2CPR18                     2485
#define SMT2CPR19                     2486
#define SMT2CPR20                     2487
#define SMT2CPR21                     2488
#define SMT2CPR22                     2489
#define SMT2CPR23                     2490
#define SMT2CPWL                      2491
#define SMT2CPWL_SMT2CPW              2492
#define SMT2CPW0                      2493
#define SMT2CPW1                      2494
#define SMT2CPW2                      2495
#define SMT2CPW3                      2496
#define SMT2CPW4                      2497
#define SMT2CPW5                      2498
#define SMT2CPW6                      2499
#define SMT2CPW7                      2500
#define SMT2CPWH                      2501
#define SMT2CPWH_SMT2CPW              2502
#define SMT2CPW8                      2503
#define SMT2CPW9                      2504
#define SMT2CPW10                     2505
#define SMT2CPW11                     2506
#define SMT2CPW12                     2507
#define SMT2CPW13                     2508
#define SMT2CPW14                     2509
#define SMT2CPW15                     2510
#define SMT2CPWU                      2511
#define SMT2CPWU_SMT2CPW              2512
#define SMT2CPW16                     2513
#define SMT2CPW17                     2514
#define SMT2CPW18                     2515
#define SMT2CPW19                     2516
#define SMT2CPW20                     2517
#define SMT2CPW21                     2518
#define SMT2CPW22                     2519
#define SMT2CPW23                     2520
#define SMT2PRL                       2521
#define SMT2PRL_SMT2PR                2522
#define SMT2PR0                       2523
#define SMT2PR1                       2524
#define SMT2PR2                       2525
#define SMT2PR3                       2526
#define SMT2PR4                       2527
#define SMT2PR5                       2528
#define SMT2PR6                       2529
#define SMT2PR7                       2530
#define SMT2PRH                       2531
#define SMT2PRH_SMT2PR                2532
#define SMT2PR8                       2533
#define SMT2PR9                       2534
#define SMT2PR10                      2535
#define SMT2PR11                      2536
#define SMT2PR12                      2537
#define SMT2PR13                      2538
#define SMT2PR14                      2539
#define SMT2PR15                      2540
#define SMT2PRU                       2541
#define SMT2PRU_SMT2PR                2542
#define SMT2PR16                      2543
#define SMT2PR17                      2544
#define SMT2PR18                      2545
#define SMT2PR19                      2546
#define SMT2PR20                      2547
#define SMT2PR21                      2548
#define SMT2PR22                      2549
#define SMT2PR23                      2550
#define SMT2CON0                      2551
#define SMT2PS0                       2552
#define SMT2PS                        2553
#define SMT2PS1                       2554
#define SMT2CON0_CPOL                 2555
#define SMT2CON0_SPOL                 2556
#define SMT2CON0_WPOL                 2557
#define SMT2CON0_STP                  2558
#define SMT2CON0_EN                   2559
#define SMT2CON1                      2560
#define SMT2CON1_MODE                 2561
#define SMT2CON1_MODE0                2562
#define SMT2MODE0                     2563
#define SMT2MODE                      2564
#define SMT2CON1_MODE1                2565
#define SMT2MODE1                     2566
#define SMT2CON1_MODE2                2567
#define SMT2MODE2                     2568
#define SMT2CON1_MODE3                2569
#define SMT2MODE3                     2570
#define SMT2REPEAT                    2571
#define SMT2CON1_REPEAT               2572
#define SMT2GO                        2573
#define SMT2STAT                      2574
#define SMT2AS                        2575
#define SMT2STAT_AS                   2576
#define SMT2WS                        2577
#define SMT2STAT_WS                   2578
#define SMT2STAT_TS                   2579
#define SMT2TS                        2580
#define SMT2RESET                     2581
#define SMT2STAT_RST                  2582
#define SMT2CPWUP                     2583
#define SMT2STAT_CPWUP                2584
#define SMT2STAT_CPRUP                2585
#define SMT2CPRUP                     2586
#define SMT2CLK                       2587
#define SMT2CLK_CSEL                  2588
#define SMT2CLK_CSEL0                 2589
#define SMT2CSEL0                     2590
#define SMT2CSEL                      2591
#define SMT2CLK_CSEL1                 2592
#define SMT2CSEL1                     2593
#define SMT2CLK_CSEL2                 2594
#define SMT2CSEL2                     2595
#define SMT2SIG                       2596
#define SMT2SIG_SSEL                  2597
#define SMT2SSEL0                     2598
#define SMT2SSEL                      2599
#define SMT2SIG_SSEL0                 2600
#define SMT2SSEL1                     2601
#define SMT2SIG_SSEL1                 2602
#define SMT2SSEL2                     2603
#define SMT2SIG_SSEL2                 2604
#define SMT2SIG_SSEL3                 2605
#define SMT2SSEL3                     2606
#define SMT2SSEL4                     2607
#define SMT2SIG_SSEL4                 2608
#define SMT2WIN                       2609
#define SMT2WIN_WSEL0                 2610
#define SMT2WSEL0                     2611
#define SMT2WSEL                      2612
#define SMT2WIN_WSEL                  2613
#define SMT2WSEL1                     2614
#define SMT2WIN_WSEL1                 2615
#define SMT2WSEL2                     2616
#define SMT2WIN_WSEL2                 2617
#define SMT2WSEL3                     2618
#define SMT2WIN_WSEL3                 2619
#define SMT2WSEL4                     2620
#define SMT2WIN_WSEL4                 2621
#define PPSLOCK                       2622
#define PPSLOCKED                     2623
#define INTPPS                        2624
#define INTPPS0                       2625
#define INTPPS1                       2626
#define INTPPS2                       2627
#define INTPPS3                       2628
#define INTPPS4                       2629
#define T0CKIPPS                      2630
#define T0CKIPPS0                     2631
#define T0CKIPPS1                     2632
#define T0CKIPPS2                     2633
#define T0CKIPPS3                     2634
#define T0CKIPPS4                     2635
#define T1CKIPPS                      2636
#define T1CKIPPS0                     2637
#define T1CKIPPS1                     2638
#define T1CKIPPS2                     2639
#define T1CKIPPS3                     2640
#define T1CKIPPS4                     2641
#define T1GPPS                        2642
#define T1GPPS0                       2643
#define T1GPPS1                       2644
#define T1GPPS2                       2645
#define T1GPPS3                       2646
#define T1GPPS4                       2647
#define CCP1PPS                       2648
#define CCP1PPS0                      2649
#define CCP1PPS1                      2650
#define CCP1PPS2                      2651
#define CCP1PPS3                      2652
#define CCP1PPS4                      2653
#define CCP2PPS                       2654
#define CCP2PPS0                      2655
#define CCP2PPS1                      2656
#define CCP2PPS2                      2657
#define CCP2PPS3                      2658
#define CCP2PPS4                      2659
#define ATINPPS                       2660
#define ATINPPS0                      2661
#define ATINPPS1                      2662
#define ATINPPS2                      2663
#define ATINPPS3                      2664
#define ATINPPS4                      2665
#define CWGINPPS                      2666
#define CWGINPPS0                     2667
#define CWGINPPS1                     2668
#define CWGINPPS2                     2669
#define CWGINPPS3                     2670
#define CWGINPPS4                     2671
#define T2PPS                         2672
#define T2PPS0                        2673
#define T2PPS1                        2674
#define T2PPS2                        2675
#define T2PPS3                        2676
#define T2PPS4                        2677
#define T3CKIPPS                      2678
#define T3CKIPPS0                     2679
#define T3CKIPPS1                     2680
#define T3CKIPPS2                     2681
#define T3CKIPPS3                     2682
#define T3CKIPPS4                     2683
#define T3GPPS                        2684
#define T3GPPS0                       2685
#define T3GPPS1                       2686
#define T3GPPS2                       2687
#define T3GPPS3                       2688
#define T3GPPS4                       2689
#define T4PPS                         2690
#define T4PPS0                        2691
#define T4PPS1                        2692
#define T4PPS2                        2693
#define T4PPS3                        2694
#define T4PPS4                        2695
#define T5CKIPPS                      2696
#define T5CKIPPS0                     2697
#define T5CKIPPS1                     2698
#define T5CKIPPS2                     2699
#define T5CKIPPS3                     2700
#define T5CKIPPS4                     2701
#define T5GPPS                        2702
#define T5GPPS0                       2703
#define T5GPPS1                       2704
#define T5GPPS2                       2705
#define T5GPPS3                       2706
#define T5GPPS4                       2707
#define T6PPS                         2708
#define T6PPS0                        2709
#define T6PPS1                        2710
#define T6PPS2                        2711
#define T6PPS3                        2712
#define T6PPS4                        2713
#define ATCC1PPS                      2714
#define ATCC1PPS0                     2715
#define ATCC1PPS1                     2716
#define ATCC1PPS2                     2717
#define ATCC1PPS3                     2718
#define ATCC1PPS4                     2719
#define SSPCLKPPS                     2720
#define SSPCLKPPS0                    2721
#define SSPCLKPPS1                    2722
#define SSPCLKPPS2                    2723
#define SSPCLKPPS3                    2724
#define SSPCLKPPS4                    2725
#define SSPDATPPS                     2726
#define SSPDATPPS0                    2727
#define SSPDATPPS1                    2728
#define SSPDATPPS2                    2729
#define SSPDATPPS3                    2730
#define SSPDATPPS4                    2731
#define SSPSSPPS                      2732
#define SSPSSPPS0                     2733
#define SSPSSPPS1                     2734
#define SSPSSPPS2                     2735
#define SSPSSPPS3                     2736
#define SSPSSPPS4                     2737
#define ATCC2PPS                      2738
#define ATCC2PPS0                     2739
#define ATCC2PPS1                     2740
#define ATCC2PPS2                     2741
#define ATCC2PPS3                     2742
#define ATCC2PPS4                     2743
#define RXPPS                         2744
#define RXPPS0                        2745
#define RXPPS1                        2746
#define RXPPS2                        2747
#define RXPPS3                        2748
#define RXPPS4                        2749
#define CKPPS                         2750
#define CKPPS0                        2751
#define CKPPS1                        2752
#define CKPPS2                        2753
#define CKPPS3                        2754
#define CKPPS4                        2755
#define SMT1SIGPPS                    2756
#define SMT1SIGPPS0                   2757
#define SMT1SIGPPS1                   2758
#define SMT1SIGPPS2                   2759
#define SMT1SIGPPS3                   2760
#define SMT1SIGPPS4                   2761
#define SMT1WINPPS                    2762
#define SMTWINPPS0                    2763
#define SMTWINPPS1                    2764
