tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1614_tdd.h
#define SMTWINPPS2                    2765
#define SMTWINPPS3                    2766
#define SMTWINPPS4                    2767
#define CLCIN0PPS                     2768
#define CLCIN0PPS0                    2769
#define CLCIN0PPS1                    2770
#define CLCIN0PPS2                    2771
#define CLCIN0PPS3                    2772
#define CLCIN0PPS4                    2773
#define CLCIN1PPS                     2774
#define CLCIN1PPS0                    2775
#define CLCIN1PPS1                    2776
#define CLCIN1PPS2                    2777
#define CLCIN1PPS3                    2778
#define CLCIN1PPS4                    2779
#define CLCIN2PPS                     2780
#define CLCIN2PPS0                    2781
#define CLCIN2PPS1                    2782
#define CLCIN2PPS2                    2783
#define CLCIN2PPS3                    2784
#define CLCIN2PPS4                    2785
#define CLCIN3PPS                     2786
#define CLCIN3PPS0                    2787
#define CLCIN3PPS1                    2788
#define CLCIN3PPS2                    2789
#define CLCIN3PPS3                    2790
#define CLCIN3PPS4                    2791
#define SMT2SIGPPS                    2792
#define SMT2SIGPPS0                   2793
#define SMT2SIGPPS1                   2794
#define SMT2SIGPPS2                   2795
#define SMT2SIGPPS3                   2796
#define SMT2SIGPPS4                   2797
#define SMT2WINPPS                    2798
#define SMT2WINPPS0                   2799
#define SMT2WINPPS1                   2800
#define SMT2WINPPS2                   2801
#define SMT2WINPPS3                   2802
#define SMT2WINPPS4                   2803
#define ATCC3PPS                      2804
#define ATCC3PPS0                     2805
#define ATCC3PPS1                     2806
#define ATCC3PPS2                     2807
#define ATCC3PPS3                     2808
#define ATCC3PPS4                     2809
#define RA0PPS                        2810
#define RA0PPS0                       2811
#define RA0PPS1                       2812
#define RA0PPS2                       2813
#define RA0PPS3                       2814
#define RA0PPS4                       2815
#define RA1PPS                        2816
#define RA1PPS0                       2817
#define RA1PPS1                       2818
#define RA1PPS2                       2819
#define RA1PPS3                       2820
#define RA1PPS4                       2821
#define RA2PPS                        2822
#define RA2PPS0                       2823
#define RA2PPS1                       2824
#define RA2PPS2                       2825
#define RA2PPS3                       2826
#define RA2PPS4                       2827
#define RA4PPS                        2828
#define RA4PPS0                       2829
#define RA4PPS1                       2830
#define RA4PPS2                       2831
#define RA4PPS3                       2832
#define RA4PPS4                       2833
#define RA5PPS                        2834
#define RA5PPS0                       2835
#define RA5PPS1                       2836
#define RA5PPS2                       2837
#define RA5PPS3                       2838
#define RA5PPS4                       2839
#define RC0PPS                        2840
#define RC0PPS0                       2841
#define RC0PPS1                       2842
#define RC0PPS2                       2843
#define RC0PPS3                       2844
#define RC0PPS4                       2845
#define RC1PPS                        2846
#define RC1PPS0                       2847
#define RC1PPS1                       2848
#define RC1PPS2                       2849
#define RC1PPS3                       2850
#define RC1PPS4                       2851
#define RC2PPS                        2852
#define RC2PPS0                       2853
#define RC2PPS1                       2854
#define RC2PPS2                       2855
#define RC2PPS3                       2856
#define RC2PPS4                       2857
#define RC3PPS                        2858
#define RC3PPS0                       2859
#define RC3PPS1                       2860
#define RC3PPS2                       2861
#define RC3PPS3                       2862
#define RC3PPS4                       2863
#define RC4PPS                        2864
#define RC4PPS0                       2865
#define RC4PPS1                       2866
#define RC4PPS2                       2867
#define RC4PPS3                       2868
#define RC4PPS4                       2869
#define RC5PPS                        2870
#define RC5PPS0                       2871
#define RC5PPS1                       2872
#define RC5PPS2                       2873
#define RC5PPS3                       2874
#define RC5PPS4                       2875
#define CLCDATA                       2876
#define MLC1OUT                       2877
#define MLC2OUT                       2878
#define CLC1CON                       2879
#define CLC1CON_MODE                  2880
#define LC1MODE0                      2881
#define LC1MODE                       2882
#define CLC1CON_MODE0                 2883
#define LC1MODE1                      2884
#define CLC1CON_MODE1                 2885
#define LC1MODE2                      2886
#define CLC1CON_MODE2                 2887
#define LC1INTN                       2888
#define CLC1CON_INTN                  2889
#define LC1INTP                       2890
#define CLC1CON_INTP                  2891
#define LC1OUT                        2892
#define CLC1CON_OUT                   2893
#define LC1EN                         2894
#define CLC1CON_EN                    2895
#define CLC1POL                       2896
#define LC1G1POL                      2897
#define CLC1POL_G1POL                 2898
#define CLC1POL_G2POL                 2899
#define LC1G2POL                      2900
#define LC1G3POL                      2901
#define CLC1POL_G3POL                 2902
#define LC1G4POL                      2903
#define CLC1POL_G4POL                 2904
#define CLC1POL_POL                   2905
#define LC1POL                        2906
#define CLC1SEL0                      2907
#define CLC1SEL0_D1S0                 2908
#define LC1D1S0                       2909
#define CLC1SEL0_D1S                  2910
#define LC1D1S                        2911
#define CLC1SEL0_D1S1                 2912
#define LC1D1S1                       2913
#define CLC1SEL0_D1S2                 2914
#define LC1D1S2                       2915
#define LC1D1S3                       2916
#define CLC1SEL0_D1S3                 2917
#define CLC1SEL0_D1S4                 2918
#define LC1D1S4                       2919
#define CLC1SEL0_D1S5                 2920
#define LC1D1S5                       2921
#define CLC1SEL1                      2922
#define CLC1SEL1_D2S0                 2923
#define CLC1SEL1_D2S                  2924
#define LC1D2S                        2925
#define LC1D2S0                       2926
#define CLC1SEL1_D2S1                 2927
#define LC1D2S1                       2928
#define CLC1SEL1_D2S2                 2929
#define LC1D2S2                       2930
#define LC1D2S3                       2931
#define CLC1SEL1_D2S3                 2932
#define LC1D2S4                       2933
#define CLC1SEL1_D2S4                 2934
#define LC1D2S5                       2935
#define CLC1SEL1_D2S5                 2936
#define CLC1SEL2                      2937
#define LC1D3S0                       2938
#define CLC1SEL2_D3S                  2939
#define LC1D3S                        2940
#define CLC1SEL2_D3S0                 2941
#define LC1D3S1                       2942
#define CLC1SEL2_D3S1                 2943
#define LC1D3S2                       2944
#define CLC1SEL2_D3S2                 2945
#define LC1D3S3                       2946
#define CLC1SEL2_D3S3                 2947
#define LC1D3S4                       2948
#define CLC1SEL2_D3S4                 2949
#define LC1D3S5                       2950
#define CLC1SEL2_D3S5                 2951
#define CLC1SEL3                      2952
#define CLC1SEL3_D4S                  2953
#define LC1D4S                        2954
#define LC1D4S0                       2955
#define CLC1SEL3_D4S0                 2956
#define CLC1SEL3_D4S1                 2957
#define LC1D4S1                       2958
#define LC1D4S2                       2959
#define CLC1SEL3_D4S2                 2960
#define LC1D4S3                       2961
#define CLC1SEL3_D4S3                 2962
#define LC1D4S4                       2963
#define CLC1SEL3_D4S4                 2964
#define LC1D4S5                       2965
#define CLC1SEL3_D4S5                 2966
#define CLC1GLS0                      2967
#define CLC1GLS0_D1N                  2968
#define LC1G1D1N                      2969
#define CLC1GLS0_D1T                  2970
#define LC1G1D1T                      2971
#define LC1G1D2N                      2972
#define CLC1GLS0_D2N                  2973
#define LC1G1D2T                      2974
#define CLC1GLS0_D2T                  2975
#define CLC1GLS0_D3N                  2976
#define LC1G1D3N                      2977
#define CLC1GLS0_D3T                  2978
#define LC1G1D3T                      2979
#define CLC1GLS0_D4N                  2980
#define LC1G1D4N                      2981
#define CLC1GLS0_D4T                  2982
#define LC1G1D4T                      2983
#define CLC1GLS1                      2984
#define CLC1GLS1_D1N                  2985
#define LC1G2D1N                      2986
#define LC1G2D1T                      2987
#define CLC1GLS1_D1T                  2988
#define CLC1GLS1_D2N                  2989
#define LC1G2D2N                      2990
#define LC1G2D2T                      2991
#define CLC1GLS1_D2T                  2992
#define CLC1GLS1_D3N                  2993
#define LC1G2D3N                      2994
#define LC1G2D3T                      2995
#define CLC1GLS1_D3T                  2996
#define CLC1GLS1_D4N                  2997
#define LC1G2D4N                      2998
#define LC1G2D4T                      2999
#define CLC1GLS1_D4T                  3000
#define CLC1GLS2                      3001
#define CLC1GLS2_D1N                  3002
#define LC1G3D1N                      3003
#define LC1G3D1T                      3004
#define CLC1GLS2_D1T                  3005
#define LC1G3D2N                      3006
#define CLC1GLS2_D2N                  3007
#define LC1G3D2T                      3008
#define CLC1GLS2_D2T                  3009
#define CLC1GLS2_D3N                  3010
#define LC1G3D3N                      3011
#define LC1G3D3T                      3012
#define CLC1GLS2_D3T                  3013
#define LC1G3D4N                      3014
#define CLC1GLS2_D4N                  3015
#define LC1G3D4T                      3016
#define CLC1GLS2_D4T                  3017
#define CLC1GLS3                      3018
#define LC1G4D1N                      3019
#define CLC1GLS3_G4D1N                3020
#define LC1G4D1T                      3021
#define CLC1GLS3_G4D1T                3022
#define CLC1GLS3_G4D2N                3023
#define LC1G4D2N                      3024
#define CLC1GLS3_G4D2T                3025
#define LC1G4D2T                      3026
#define LC1G4D3N                      3027
#define CLC1GLS3_G4D3N                3028
#define LC1G4D3T                      3029
#define CLC1GLS3_G4D3T                3030
#define CLC1GLS3_G4D4N                3031
#define LC1G4D4N                      3032
#define CLC1GLS3_G4D4T                3033
#define LC1G4D4T                      3034
#define CLC2CON                       3035
#define LC2MODE0                      3036
#define CLC2CON_MODE                  3037
#define LC2MODE                       3038
#define CLC2CON_MODE0                 3039
#define LC2MODE1                      3040
#define CLC2CON_MODE1                 3041
#define LC2MODE2                      3042
#define CLC2CON_MODE2                 3043
#define LC2INTN                       3044
#define CLC2CON_INTN                  3045
#define LC2INTP                       3046
#define CLC2CON_INTP                  3047
#define CLC2CON_OUT                   3048
#define LC2OUT                        3049
#define CLC2CON_EN                    3050
#define LC2EN                         3051
#define CLC2POL                       3052
#define LC2G1POL                      3053
#define CLC2POL_G1POL                 3054
#define LC2G2POL                      3055
#define CLC2POL_G2POL                 3056
#define LC2G3POL                      3057
#define CLC2POL_G3POL                 3058
#define LC2G4POL                      3059
#define CLC2POL_G4POL                 3060
#define CLC2POL_POL                   3061
#define LC2POL                        3062
#define CLC2SEL0                      3063
#define CLC2SEL0_D1S                  3064
#define LC2D1S0                       3065
#define CLC2SEL0_D1S0                 3066
#define LC2D1S                        3067
#define LC2D1S1                       3068
#define CLC2SEL0_D1S1                 3069
#define LC2D1S2                       3070
#define CLC2SEL0_D1S2                 3071
#define CLC2SEL0_D1S3                 3072
#define LC2D1S3                       3073
#define LC2D1S4                       3074
#define CLC2SEL0_D1S4                 3075
#define LC2D1S5                       3076
#define CLC2SEL0_D1S5                 3077
#define CLC2SEL1                      3078
#define LC2D2S0                       3079
#define CLC2SEL1_D2S0                 3080
#define LC2D2S                        3081
#define CLC2SEL1_D2S                  3082
#define LC2D2S1                       3083
#define CLC2SEL1_D2S1                 3084
#define LC2D2S2                       3085
#define CLC2SEL1_D2S2                 3086
#define LC2D2S3                       3087
#define CLC2SEL1_D2S3                 3088
#define LC2D2S4                       3089
#define CLC2SEL1_D2S4                 3090
#define LC2D2S5                       3091
#define CLC2SEL1_D2S5                 3092
#define CLC2SEL2                      3093
#define CLC2SEL2_D3S                  3094
#define LC2D3S0                       3095
#define CLC2SEL2_D3S0                 3096
#define LC2D3S                        3097
#define CLC2SEL2_D3S1                 3098
#define LC2D3S1                       3099
#define LC2D3S2                       3100
#define CLC2SEL2_D3S2                 3101
#define LC2D3S3                       3102
#define CLC2SEL2_D3S3                 3103
#define LC2D3S4                       3104
#define CLC2SEL2_D3S4                 3105
#define LC2D3S5                       3106
#define CLC2SEL2_D3S5                 3107
#define CLC2SEL3                      3108
#define LC2D4S0                       3109
#define CLC2SEL3_D4S                  3110
#define CLC2SEL3_D4S0                 3111
#define LC2D4S                        3112
#define LC2D4S1                       3113
#define CLC2SEL3_D4S1                 3114
#define LC2D4S2                       3115
#define CLC2SEL3_D4S2                 3116
#define CLC2SEL3_D4S3                 3117
#define LC2D4S3                       3118
#define LC2D4S4                       3119
#define CLC2SEL3_D4S4                 3120
#define LC2D4S5                       3121
#define CLC2SEL3_D4S5                 3122
#define CLC2GLS0                      3123
#define LC2G1D1N                      3124
#define CLC2GLS0_D1N                  3125
#define CLC2GLS0_D1T                  3126
#define LC2G1D1T                      3127
#define LC2G1D2N                      3128
#define CLC2GLS0_D2N                  3129
#define CLC2GLS0_D2T                  3130
#define LC2G1D2T                      3131
#define LC2G1D3N                      3132
#define CLC2GLS0_D3N                  3133
#define CLC2GLS0_D3T                  3134
#define LC2G1D3T                      3135
#define LC2G1D4N                      3136
#define CLC2GLS0_D4N                  3137
#define CLC2GLS0_D4T                  3138
#define LC2G1D4T                      3139
#define CLC2GLS1                      3140
#define CLC2GLS1_D1N                  3141
#define LC2G2D1N                      3142
#define CLC2GLS1_D1T                  3143
#define LC2G2D1T                      3144
#define CLC2GLS1_D2N                  3145
#define LC2G2D2N                      3146
#define CLC2GLS1_D2T                  3147
#define LC2G2D2T                      3148
#define LC2G2D3N                      3149
#define CLC2GLS1_D3N                  3150
#define LC2G2D3T                      3151
#define CLC2GLS1_D3T                  3152
#define LC2G2D4N                      3153
#define CLC2GLS1_D4N                  3154
#define LC2G2D4T                      3155
#define CLC2GLS1_D4T                  3156
#define CLC2GLS2                      3157
#define LC2G3D1N                      3158
#define CLC2GLS2_D1N                  3159
#define CLC2GLS2_D1T                  3160
#define LC2G3D1T                      3161
#define CLC2GLS2_D2N                  3162
#define LC2G3D2N                      3163
#define LC2G3D2T                      3164
#define CLC2GLS2_D2T                  3165
#define CLC2GLS2_D3N                  3166
#define LC2G3D3N                      3167
#define CLC2GLS2_D3T                  3168
#define LC2G3D3T                      3169
#define CLC2GLS2_D4N                  3170
#define LC2G3D4N                      3171
#define LC2G3D4T                      3172
#define CLC2GLS2_D4T                  3173
#define CLC2GLS3                      3174
#define LC2G4D1N                      3175
#define CLC2GLS3_G4D1N                3176
#define CLC2GLS3_G4D1T                3177
#define LC2G4D1T                      3178
#define CLC2GLS3_G4D2N                3179
#define LC2G4D2N                      3180
#define LC2G4D2T                      3181
#define CLC2GLS3_G4D2T                3182
#define CLC2GLS3_G4D3N                3183
#define LC2G4D3N                      3184
#define CLC2GLS3_G4D3T                3185
#define LC2G4D3T                      3186
#define LC2G4D4N                      3187
#define CLC2GLS3_G4D4N                3188
#define CLC2GLS3_G4D4T                3189
#define LC2G4D4T                      3190
#define STATUS_SHAD                   3191
#define C_SHAD                        3192
#define DC_SHAD                       3193
#define Z_SHAD                        3194
#define WREG_SHAD                     3195
#define BSR_SHAD                      3196
#define PCLATH_SHAD                   3197
#define FSR0L_SHAD                    3198
#define FSR0H_SHAD                    3199
#define FSR1L_SHAD                    3200
#define FSR1H_SHAD                    3201
#define STKPTR                        3202
#define TOSL                          3203
#define TOSH                          3204

#endif // _PIC16F1614_H_
